console.log(
  "------------------------------------------Арифметические операции--------------------------------------------------------"
);
console.log("5" - 2);
console.log("5" + 2);
console.log(true + 1);
console.log(false * 3);
console.log(null + 5);
console.log(undefined + 5);

console.log(
  "---------------------------------------------- Сравнения-------------------------------------------------------------------"
);
console.log("5" > 3);
console.log("01" == 1);
console.log(true == 1);
console.log(false == 0);
console.log(null == 0);
console.log(null == undefined);

console.log(
  "--------------------------------------Преобразование при сложении строк и чисел-------------------------------------------"
);
console.log("The result is: " + 5 + 10);
console.log("The result is: " + (5 + 10));

console.log(
  "------------------------------------------- Пример с массивами-------------------------------------------------------------"
);
console.log([1, 2] + 3);
console.log([] + 1);
console.log([10] - 1);
console.log([10, 20] - 1);

/*
Ответ будет следующий?
------------------------------------------Арифметические операции--------------------------------------------------------
3
52
2
0
5
NaN

---------------------------------------------- Сравнения-------------------------------------------------------------------
true
true
true
true
false
true

--------------------------------------Преобразование при сложении строк и чисел-------------------------------------------
The result is: 510
The result is: 15

------------------------------------------- Пример с массивами-------------------------------------------------------------
1,23
1
9
NaN
*/
